Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/svd/PIC32CX1025MTC128S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SYSCWP</name>
         <version>04675C</version>
         <description>External Interrupt Controller</description>
         <baseAddress>0x400531A0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SYSC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits. Always reads as 0.</description>
                           <value>0x535943</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSC_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Register Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WVSRC</name>
                     <description>Write Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>TC0</name>
         <version>44162D</version>
         <description>Timer Counter</description>
         <groupName>TC</groupName>
         <prependToName>TC_</prependToName>
         <baseAddress>0x40038000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x12C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TC0_CHANNEL0</name>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>TC0_CHANNEL1</name>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>TC0_CHANNEL2</name>
            <value>33</value>
         </interrupt>
         <interrupt>
            <name>TC0_C0SEC</name>
            <value>40</value>
         </interrupt>
         <interrupt>
            <name>TC0_C1SEC</name>
            <value>41</value>
         </interrupt>
         <interrupt>
            <name>TC0_C2SEC</name>
            <value>42</value>
         </interrupt>
         <registers>
            <cluster>
               <dim>3</dim>
               <dimIncrement>64</dimIncrement>
               <name>TC_CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CCR</name>
                  <description>Channel Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CLKEN</name>
                        <description>Counter Clock Enable Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKDIS</name>
                        <description>Counter Clock Disable Command</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWTRG</name>
                        <description>Software Trigger Command</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CMR_CAPTURE_MODE</name>
                  <description>Channel Mode Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>TCCLKS</name>
                        <description>Clock Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>TCCLKSSelect</name>
                           <enumeratedValue>
                              <name>TIMER_CLOCK1</name>
                              <description>Clock selected: internal GCLK [TC_ID] clock signal (from PMC)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK2</name>
                              <description>Clock selected: internal MCK/8 clock signal (from PMC)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK3</name>
                              <description>Clock selected: internal MCK/32 clock signal (from PMC)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK4</name>
                              <description>Clock selected: internal MCK/128 clock signal (from PMC)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK5</name>
                              <description>Clock selected: internal MD_SLCK clock signal (from PMC)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>Clock selected: XC0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>Clock selected: XC1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>Clock selected: XC2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CLKI</name>
                        <description>Clock Invert</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BURST</name>
                        <description>Burst Signal Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BURSTSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>The clock is not gated by an external signal.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>XC0 is ANDed with the selected clock.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>XC1 is ANDed with the selected clock.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>XC2 is ANDed with the selected clock.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LDBSTOP</name>
                        <description>Counter Clock Stopped with RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDBDIS</name>
                        <description>Counter Clock Disable with RB Loading</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGEDG</name>
                        <description>External Trigger Edge Selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>ETRGEDGSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>The clock is not gated by an external signal.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ABETRG</name>
                        <description>TIOAx or TIOBx External Trigger Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCTRG</name>
                        <description>RC Compare Trigger Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRA</name>
                        <description>RA Loading Edge Selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LDRASelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>None</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge of TIOAx</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge of TIOAx</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge of TIOAx</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LDRB</name>
                        <description>RB Loading Edge Selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LDRBSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>None</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge of TIOAx</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge of TIOAx</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge of TIOAx</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SBSMPLR</name>
                        <description>Loading Edge Subsampling Ratio</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SBSMPLRSelect</name>
                           <enumeratedValue>
                              <name>ONE</name>
                              <description>Load a Capture register each selected edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Load a Capture register every 2 selected edges</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FOURTH</name>
                              <description>Load a Capture register every 4 selected edges</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EIGHTH</name>
                              <description>Load a Capture register every 8 selected edges</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SIXTEENTH</name>
                              <description>Load a Capture register every 16 selected edges</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WAVE</name>
                        <description>Waveform Mode</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
